<!-- add-pr-comment:add-pr-comment -->

Terraform Plan **production **:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.crom_vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
+   resource "aws_cloudwatch_log_group" "flow_log" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = (known after apply)
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags              = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
+       tags_all          = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
    }

  # module.crom_vpc.module.vpc.aws_customer_gateway.this["IP1"] will be created
+   resource "aws_customer_gateway" "this" {
+       arn         = (known after apply)
+       bgp_asn     = "65112"
+       device_name = "some_name"
+       id          = (known after apply)
+       ip_address  = "1.2.3.4"
+       tags        = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-IP1"
        }
+       tags_all    = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-IP1"
        }
+       type        = "ipsec.1"
    }

  # module.crom_vpc.module.vpc.aws_customer_gateway.this["IP2"] will be created
+   resource "aws_customer_gateway" "this" {
+       arn        = (known after apply)
+       bgp_asn    = "65112"
+       id         = (known after apply)
+       ip_address = "5.6.7.8"
+       tags       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-IP2"
        }
+       tags_all   = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-IP2"
        }
+       type       = "ipsec.1"
    }

  # module.crom_vpc.module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
+       tags_all             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
+       vpc                  = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
+   resource "aws_elasticache_subnet_group" "elasticache" {
+       arn         = (known after apply)
+       description = "ElastiCache subnet group for webapp-kube-1-0-6"
+       id          = (known after apply)
+       name        = "webapp-kube-1-0-6"
+       subnet_ids  = (known after apply)
+       tags        = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all    = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_flow_log.this[0] will be created
+   resource "aws_flow_log" "this" {
+       arn                      = (known after apply)
+       iam_role_arn             = (known after apply)
+       id                       = (known after apply)
+       log_destination          = (known after apply)
+       log_destination_type     = "cloud-watch-logs"
+       log_format               = (known after apply)
+       log_group_name           = (known after apply)
+       max_aggregation_interval = 60
+       tags                     = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
+       tags_all                 = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
+       traffic_type             = "ALL"
+       vpc_id                   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
+   resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
+       arn         = (known after apply)
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "vpc-flow-log-to-cloudwatch-"
+       path        = "/"
+       policy      = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "logs:PutLogEvents",
+                           "logs:DescribeLogStreams",
+                           "logs:DescribeLogGroups",
+                           "logs:CreateLogStream",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
+                       Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id   = (known after apply)
+       tags        = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
+       tags_all    = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
    }

  # module.crom_vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
+   resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "vpc-flow-logs.amazonaws.com"
                        }
+                       Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "vpc-flow-log-role-"
+       path                  = "/"
+       tags                  = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
+       tags_all              = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
        }
+       unique_id             = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
+   resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       vpc_id   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
+       tags_all                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
    }

  # module.crom_vpc.module.vpc.aws_redshift_subnet_group.redshift[0] will be created
+   resource "aws_redshift_subnet_group" "redshift" {
+       arn         = (known after apply)
+       description = "Redshift subnet group for webapp-kube-1-0-6"
+       id          = (known after apply)
+       name        = "webapp-kube-1-0-6"
+       subnet_ids  = (known after apply)
+       tags        = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all    = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route_table.intra[0] will be created
+   resource "aws_route_table" "intra" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra"
        }
+       tags_all         = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra"
        }
+       vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private"
        }
+       tags_all         = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private"
        }
+       vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public"
        }
+       tags_all         = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public"
        }
+       vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.database[0] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.database[1] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.database[2] will be created
+   resource "aws_route_table_association" "database" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.elasticache[0] will be created
+   resource "aws_route_table_association" "elasticache" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.elasticache[1] will be created
+   resource "aws_route_table_association" "elasticache" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.elasticache[2] will be created
+   resource "aws_route_table_association" "elasticache" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.intra[0] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.intra[1] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.intra[2] will be created
+   resource "aws_route_table_association" "intra" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.redshift[0] will be created
+   resource "aws_route_table_association" "redshift" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.redshift[1] will be created
+   resource "aws_route_table_association" "redshift" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.redshift[2] will be created
+   resource "aws_route_table_association" "redshift" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.database[0] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.8.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "DB Subnet One"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "DB Subnet One"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.database[1] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.9.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-db-us-east-1b"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-db-us-east-1b"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.database[2] will be created
+   resource "aws_subnet" "database" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.10.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-db-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-db-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.elasticache[0] will be created
+   resource "aws_subnet" "elasticache" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.12.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Elasticache Subnet One"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Elasticache Subnet One"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.elasticache[1] will be created
+   resource "aws_subnet" "elasticache" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.13.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Elasticache Subnet Two"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Elasticache Subnet Two"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.elasticache[2] will be created
+   resource "aws_subnet" "elasticache" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.14.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-elasticache-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-elasticache-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.intra[0] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.20.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra-us-east-1a"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra-us-east-1a"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.intra[1] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.21.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra-us-east-1b"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra-us-east-1b"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.intra[2] will be created
+   resource "aws_subnet" "intra" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.22.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-intra-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet One"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet One"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet Two"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Private Subnet Two"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.4.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.5.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.6.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.redshift[0] will be created
+   resource "aws_subnet" "redshift" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.16.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Redshift Subnet One"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Redshift Subnet One"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.redshift[1] will be created
+   resource "aws_subnet" "redshift" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.17.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Redshift Subnet Two"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Redshift Subnet Two"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.redshift[2] will be created
+   resource "aws_subnet" "redshift" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.18.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Redshift Subnet Three"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "Redshift Subnet Three"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all                             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_vpc_dhcp_options.this[0] will be created
+   resource "aws_vpc_dhcp_options" "this" {
+       arn                  = (known after apply)
+       domain_name          = "service.consul"
+       domain_name_servers  = [
+           "127.0.0.1",
+           "10.10.0.2",
        ]
+       id                   = (known after apply)
+       netbios_name_servers = []
+       ntp_servers          = []
+       owner_id             = (known after apply)
+       tags                 = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all             = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_vpc_dhcp_options_association.this[0] will be created
+   resource "aws_vpc_dhcp_options_association" "this" {
+       dhcp_options_id = (known after apply)
+       id              = (known after apply)
+       vpc_id          = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpn_gateway.this[0] will be created
+   resource "aws_vpn_gateway" "this" {
+       amazon_side_asn = "64512"
+       arn             = (known after apply)
+       id              = (known after apply)
+       tags            = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       tags_all        = {
+           "Example"    = "webapp-kube-1-0-6"
+           "GithubOrg"  = "terraform-aws-modules"
+           "GithubRepo" = "terraform-aws-vpc"
+           "Name"       = "webapp-kube-1-0-6"
        }
+       vpc_id          = (known after apply)
    }

Plan: 57 to add, 0 to change, 0 to destroy. 
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.crom_vpc.module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
      + tags_all          = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
    }

  # module.crom_vpc.module.vpc.aws_customer_gateway.this["IP1"] will be created
  + resource "aws_customer_gateway" "this" {
      + arn         = (known after apply)
      + bgp_asn     = "65112"
      + device_name = "some_name"
      + id          = (known after apply)
      + ip_address  = "1.2.3.4"
      + tags        = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-IP1"
        }
      + tags_all    = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-IP1"
        }
      + type        = "ipsec.1"
    }

  # module.crom_vpc.module.vpc.aws_customer_gateway.this["IP2"] will be created
  + resource "aws_customer_gateway" "this" {
      + arn        = (known after apply)
      + bgp_asn    = "65112"
      + id         = (known after apply)
      + ip_address = "5.6.7.8"
      + tags       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-IP2"
        }
      + tags_all   = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-IP2"
        }
      + type       = "ipsec.1"
    }

  # module.crom_vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
      + tags_all             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for webapp-kube-1-0-6"
      + id          = (known after apply)
      + name        = "webapp-kube-1-0-6"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all    = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 60
      + tags                     = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
      + tags_all                 = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "vpc-flow-log-to-cloudwatch-"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AWSVPCFlowLogsPushToCloudWatch"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
      + tags_all    = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
    }

  # module.crom_vpc.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
      + tags_all              = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
        }
      + unique_id             = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + vpc_id   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
      + tags_all                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-us-east-1a"
        }
    }

  # module.crom_vpc.module.vpc.aws_redshift_subnet_group.redshift[0] will be created
  + resource "aws_redshift_subnet_group" "redshift" {
      + arn         = (known after apply)
      + description = "Redshift subnet group for webapp-kube-1-0-6"
      + id          = (known after apply)
      + name        = "webapp-kube-1-0-6"
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all    = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra"
        }
      + tags_all         = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra"
        }
      + vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private"
        }
      + tags_all         = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public"
        }
      + tags_all         = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.database[2] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.elasticache[0] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.elasticache[1] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.elasticache[2] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.intra[2] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.redshift[0] will be created
  + resource "aws_route_table_association" "redshift" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.redshift[1] will be created
  + resource "aws_route_table_association" "redshift" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.redshift[2] will be created
  + resource "aws_route_table_association" "redshift" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.8.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "DB Subnet One"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "DB Subnet One"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.9.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-db-us-east-1b"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-db-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.database[2] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.10.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-db-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-db-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.elasticache[0] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Elasticache Subnet One"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Elasticache Subnet One"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.elasticache[1] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.13.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Elasticache Subnet Two"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Elasticache Subnet Two"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.elasticache[2] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.14.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-elasticache-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-elasticache-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.20.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra-us-east-1a"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra-us-east-1b"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.intra[2] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-intra-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet One"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet One"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet Two"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Private Subnet Two"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.redshift[0] will be created
  + resource "aws_subnet" "redshift" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.16.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Redshift Subnet One"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Redshift Subnet One"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.redshift[1] will be created
  + resource "aws_subnet" "redshift" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.17.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Redshift Subnet Two"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Redshift Subnet Two"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.redshift[2] will be created
  + resource "aws_subnet" "redshift" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.18.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Redshift Subnet Three"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "Redshift Subnet Three"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all                             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_vpc_dhcp_options.this[0] will be created
  + resource "aws_vpc_dhcp_options" "this" {
      + arn                  = (known after apply)
      + domain_name          = "service.consul"
      + domain_name_servers  = [
          + "127.0.0.1",
          + "10.10.0.2",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = []
      + ntp_servers          = []
      + owner_id             = (known after apply)
      + tags                 = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all             = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
    }

  # module.crom_vpc.module.vpc.aws_vpc_dhcp_options_association.this[0] will be created
  + resource "aws_vpc_dhcp_options_association" "this" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpn_gateway.this[0] will be created
  + resource "aws_vpn_gateway" "this" {
      + amazon_side_asn = "64512"
      + arn             = (known after apply)
      + id              = (known after apply)
      + tags            = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + tags_all        = {
          + "Example"    = "webapp-kube-1-0-6"
          + "GithubOrg"  = "terraform-aws-modules"
          + "GithubRepo" = "terraform-aws-vpc"
          + "Name"       = "webapp-kube-1-0-6"
        }
      + vpc_id          = (known after apply)
    }

Plan: 57 to add, 0 to change, 0 to destroy.
 
```